jassony/infineon2b6/TLE9563_LLD/src/TLE9563_CommLayer.c
/* DMA - descriptors for SPI transfer */
static  cy_stc_pdma_descr_t         stcDescr1e;
static  cy_stc_pdma_descr_t         stcDescr11a;

#if  (TLE9563_CRC_EN == 1)
/* DMA - descriptors for CRC calculation */
static  cy_stc_pdma_descr_t         stcDescr1a;
static  cy_stc_pdma_descr_t         stcDescr1b;
static  cy_stc_pdma_descr_t         stcDescr1c;
static  cy_stc_pdma_descr_t         stcDescr1d;
static  cy_stc_pdma_descr_t         stcDescr11b;
static  cy_stc_pdma_descr_t         stcDescr11c;
static  cy_stc_pdma_descr_t         stcDescr11d;

/* DMA - CRC seed value */
static  uint32_t                    u32CrcSeed      =   0xff000000;

/* DMA - CRC configuration */
const   cy_stc_pdma_crc_config_t    stcCrcConfig    =   {
                                                            .data_reverse = 1,                  
                                                            .rem_reverse  = 1,              
                                                            .data_xor     = 0,                      
                                                            .polynomial   = 0x2f << 24,             
                                                            .lfsr32       = 0xff000000,                     
                                                            .rem_xor      = 0xff000000,                       
                                                        };

/* DMA - Descriptor configurations for CRC */
/* Initialize CRC engine with correct seed value before any CRC calculation */
static  cy_stc_pdma_descr_config_t  stcDmaDescrConfig1a =  {
                                                            .deact          =   0,
                                                            .intrType       =   CY_PDMA_INTR_DESCRCHAIN_CMPLT,
                                                            .trigoutType    =   CY_PDMA_TRIGOUT_DESCRCHAIN_CMPLT,
                                                            .chStateAtCmplt =   CY_PDMA_CH_ENABLED, 
                                                            .triginType     =   CY_PDMA_TRIGIN_DESCRCHAIN,
                                                            .dataSize       =   CY_PDMA_WORD,
                                                            .srcTxfrSize    =   CY_PDMA_TXFR_SIZE_DATA_SIZE,
                                                            .destTxfrSize   =   CY_PDMA_TXFR_SIZE_DATA_SIZE,
                                                            .descrType      =   CY_PDMA_SINGLE_TRANSFER,
                                                            .srcAddr        =   (void*) &u32CrcSeed,
                                                            .destAddr       =   (void*) &PDMA_INSTANCE->unCRC_LFSR_CTL.u32Register,
                                                            .srcXincr       =   0, // don't care
                                                            .destXincr      =   0, // don't care
                                                            .xCount         =   0, // don't care
                                                            .srcYincr       =   0, // don't care
                                                            .destYincr      =   0, // don't care
                                                            .yCount         =   0, // don't care
                                                            .descrNext      =   &stcDescr1b,
                                                        };

/* Calculate CRC */
static  cy_stc_pdma_descr_config_t  stcDmaDescrConfig1b =  {
                                                            .deact          =   0,
                                                            .intrType       =   CY_PDMA_INTR_DESCRCHAIN_CMPLT,
                                                            .trigoutType    =   CY_PDMA_TRIGOUT_DESCRCHAIN_CMPLT,
                                                            .chStateAtCmplt =   CY_PDMA_CH_ENABLED, 
                                                            .triginType     =   CY_PDMA_TRIGIN_DESCRCHAIN,
                                                            .dataSize       =   CY_PDMA_BYTE,
                                                            .srcTxfrSize    =   CY_PDMA_TXFR_SIZE_DATA_SIZE,
                                                            .destTxfrSize   =   CY_PDMA_TXFR_SIZE_WORD,
                                                            .descrType      =   CY_PDMA_CRC_TRANSFER,
                                                            .srcAddr        =   (void*) &au8TxBuffer.u32Word,
                                                            .destAddr       =   (void*) &s_deviceDriver.un_CrcResult.u32Word, // note: destinationwill be overwritten by next descriptor with CRC post-processed result
                                                            .srcXincr       =   1,
                                                            .destXincr      =   0,
                                                            .xCount         =   3,
                                                            .srcYincr       =   0, // don't care
                                                            .destYincr      =   0, // don't care
                                                            .yCount         =   0, // don't care
                                                            .descrNext      =   &stcDescr1c,
                                                        };

/* Copy post-processed CRC result from register to temporary buffer in SRAM (register can only be accessed with 32-bit!) */
static  cy_stc_pdma_descr_config_t  stcDmaDescrConfig1c =  {
                                                            .deact          =   0,
                                                            .intrType       =   CY_PDMA_INTR_DESCRCHAIN_CMPLT,
                                                            .trigoutType    =   CY_PDMA_TRIGOUT_DESCRCHAIN_CMPLT,
                                                            .chStateAtCmplt =   CY_PDMA_CH_ENABLED, 
                                                            .triginType     =   CY_PDMA_TRIGIN_DESCRCHAIN,
                                                            .dataSize       =   CY_PDMA_WORD,
                                                            .srcTxfrSize    =   CY_PDMA_TXFR_SIZE_DATA_SIZE,
                                                            .destTxfrSize   =   CY_PDMA_TXFR_SIZE_DATA_SIZE,
                                                            .descrType      =   CY_PDMA_SINGLE_TRANSFER,
                                                            .srcAddr        =   (void*) &PDMA_INSTANCE->unCRC_REM_RESULT.u32Register,
                                                            .destAddr       =   (void*) &s_deviceDriver.un_CrcResult.u32Word,
                                                            .srcXincr       =   0, // don't care
                                                            .destXincr      =   0, // don't care
                                                            .xCount         =   0, // don't care
                                                            .srcYincr       =   0, // don't care
                                                            .destYincr      =   0, // don't care
                                                            .yCount         =   0, // don't care
                                                            .descrNext      =   &stcDescr1d,
                                                        };

/* Copy single CRC byte into correct location of SPI TX buffer */
static  cy_stc_pdma_descr_config_t  stcDmaDescrConfig1d =  {
                                                            .deact          =   0,
                                                            .intrType       =   CY_PDMA_INTR_DESCRCHAIN_CMPLT,
                                                            .trigoutType    =   CY_PDMA_TRIGOUT_DESCRCHAIN_CMPLT,
                                                            .chStateAtCmplt =   CY_PDMA_CH_ENABLED, 
                                                            .triginType     =   CY_PDMA_TRIGIN_DESCRCHAIN,
                                                            .dataSize       =   CY_PDMA_BYTE,
                                                            .srcTxfrSize    =   CY_PDMA_TXFR_SIZE_DATA_SIZE,
                                                            .destTxfrSize   =   CY_PDMA_TXFR_SIZE_DATA_SIZE,
                                                            .descrType      =   CY_PDMA_SINGLE_TRANSFER,
                                                            .srcAddr        =   (void*) &s_deviceDriver.un_CrcResult.au8Bytes[0],
                                                            .destAddr       =   (void*) &au8TxBuffer.au8Bytes[3],
                                                            .srcXincr       =   0, // don't care
                                                            .destXincr      =   0, // don't care
                                                            .xCount         =   0, // don't care
                                                            .srcYincr       =   0, // don't care
                                                            .destYincr      =   0, // don't care
                                                            .yCount         =   0, // don't care
                                                            .descrNext      =   &stcDescr1e,
                                                        };

/* Copy SPI TX buffer into SPI TX FIFO */
static  cy_stc_pdma_descr_config_t  stcDmaDescrConfig1e =  {
                                                            .deact          =   0,
                                                            .intrType       =   CY_PDMA_INTR_DESCRCHAIN_CMPLT,
                                                            .trigoutType    =   CY_PDMA_TRIGOUT_DESCRCHAIN_CMPLT,
                                                            .chStateAtCmplt =   CY_PDMA_CH_DISABLED, 
                                                            .triginType     =   CY_PDMA_TRIGIN_DESCRCHAIN,
                                                            .dataSize       =   CY_PDMA_WORD,
                                                            .srcTxfrSize    =   CY_PDMA_TXFR_SIZE_DATA_SIZE,
                                                            .destTxfrSize   =   CY_PDMA_TXFR_SIZE_DATA_SIZE,
                                                            .descrType      =   CY_PDMA_SINGLE_TRANSFER,
                                                            .srcAddr        =   (void*) &au8TxBuffer.u32Word,
                                                            .destAddr       =   (void*) &CY_SPI_SCB_TYPE->unTX_FIFO_WR.u32Register,
                                                            .srcXincr       =   0, // don't care
                                                            .destXincr      =   0, // don't care
                                                            .xCount         =   0, // don't care
                                                            .srcYincr       =   0, // don't care
                                                            .destYincr      =   0, // don't care
                                                            .yCount         =   0, // don't care
                                                            .descrNext      =   0,
                                                        };

/* Copy SPI RX FIFO into receive buffer and continue with CRC calculation */
static  cy_stc_pdma_descr_config_t  stcDmaDescrConfig11a =  {
                                                            .deact          =   0,
                                                            .intrType       =   CY_PDMA_INTR_DESCRCHAIN_CMPLT,
                                                            .trigoutType    =   CY_PDMA_TRIGOUT_DESCRCHAIN_CMPLT,
                                                            .chStateAtCmplt =   CY_PDMA_CH_ENABLED, 
                                                            .triginType     =   CY_PDMA_TRIGIN_DESCRCHAIN,
                                                            .dataSize       =   CY_PDMA_WORD,
                                                            .srcTxfrSize    =   CY_PDMA_TXFR_SIZE_DATA_SIZE,
                                                            .destTxfrSize   =   CY_PDMA_TXFR_SIZE_DATA_SIZE,
                                                            .descrType      =   CY_PDMA_SINGLE_TRANSFER,
                                                            .srcAddr        =   (void*) &CY_SPI_SCB_TYPE->unRX_FIFO_RD.u32Register,
                                                            .destAddr       =   (void*) &s_deviceDriver.un_SpiRx.u32Word,
                                                            .srcXincr       =   0, // don't care
                                                            .destXincr      =   0, // don't care
                                                            .xCount         =   0, // don't care
                                                            .srcYincr       =   0, // don't care
                                                            .destYincr      =   0, // don't care
                                                            .yCount         =   0, // don't care
                                                            .descrNext      =   &stcDescr11b,
                                                        };

/* Initialize CRC engine with correct seed value before any CRC calculation */
static  cy_stc_pdma_descr_config_t  stcDmaDescrConfig11b =  {
                                                            .deact          =   0,
                                                            .intrType       =   CY_PDMA_INTR_DESCRCHAIN_CMPLT,
                                                            .trigoutType    =   CY_PDMA_TRIGOUT_DESCRCHAIN_CMPLT,
                                                            .chStateAtCmplt =   CY_PDMA_CH_ENABLED, 
                                                            .triginType     =   CY_PDMA_TRIGIN_DESCRCHAIN,
                                                            .dataSize       =   CY_PDMA_WORD,
                                                            .srcTxfrSize    =   CY_PDMA_TXFR_SIZE_DATA_SIZE,
                                                            .destTxfrSize   =   CY_PDMA_TXFR_SIZE_DATA_SIZE,
                                                            .descrType      =   CY_PDMA_SINGLE_TRANSFER,
                                                            .srcAddr        =   (void*) &u32CrcSeed,
                                                            .destAddr       =   (void*) &PDMA_INSTANCE->unCRC_LFSR_CTL.u32Register,
                                                            .srcXincr       =   0, // don't care
                                                            .destXincr      =   0, // don't care
                                                            .xCount         =   0, // don't care
                                                            .srcYincr       =   0, // don't care
                                                            .destYincr      =   0, // don't care
                                                            .yCount         =   0, // don't care
                                                            .descrNext      =   &stcDescr11c,
                                                        };

/* Calculate CRC */
/* note: destination will be overwritten by next descriptor with CRC post-processed result */
static  cy_stc_pdma_descr_config_t  stcDmaDescrConfig11c =  {
                                                            .deact          =   0,
                                                            .intrType       =   CY_PDMA_INTR_DESCRCHAIN_CMPLT,
                                                            .trigoutType    =   CY_PDMA_TRIGOUT_DESCRCHAIN_CMPLT,
                                                            .chStateAtCmplt =   CY_PDMA_CH_ENABLED, 
                                                            .triginType     =   CY_PDMA_TRIGIN_DESCRCHAIN,
                                                            .dataSize       =   CY_PDMA_BYTE,
                                                            .srcTxfrSize    =   CY_PDMA_TXFR_SIZE_DATA_SIZE,
                                                            .destTxfrSize   =   CY_PDMA_TXFR_SIZE_WORD,
                                                            .descrType      =   CY_PDMA_CRC_TRANSFER,
                                                            .srcAddr        =   (void*) &s_deviceDriver.un_SpiRx.u32Word,
                                                            .destAddr       =   (void*) &s_deviceDriver.un_CrcResult.u32Word,
                                                            .srcXincr       =   1,
                                                            .destXincr      =   0,
                                                            .xCount         =   3,
                                                            .srcYincr       =   0, // don't care
                                                            .destYincr      =   0, // don't care
                                                            .yCount         =   0, // don't care
                                                            .descrNext      =   &stcDescr11d,
                                                        };

/* Copy post-processed CRC result from register to temporary buffer in SRAM (register can only be accessed with 32-bit!) */
static  cy_stc_pdma_descr_config_t  stcDmaDescrConfig11d =  {
                                                            .deact          =   0,
                                                            .intrType       =   CY_PDMA_INTR_DESCRCHAIN_CMPLT,
                                                            .trigoutType    =   CY_PDMA_TRIGOUT_DESCRCHAIN_CMPLT,
                                                            .chStateAtCmplt =   CY_PDMA_CH_DISABLED, 
                                                            .triginType     =   CY_PDMA_TRIGIN_DESCRCHAIN,
                                                            .dataSize       =   CY_PDMA_WORD,
                                                            .srcTxfrSize    =   CY_PDMA_TXFR_SIZE_DATA_SIZE,
                                                            .destTxfrSize   =   CY_PDMA_TXFR_SIZE_DATA_SIZE,
                                                            .descrType      =   CY_PDMA_SINGLE_TRANSFER,
                                                            .srcAddr        =   (void*) &PDMA_INSTANCE->unCRC_REM_RESULT.u32Register,
                                                            .destAddr       =   (void*) &s_deviceDriver.un_CrcResult.u32Word,
                                                            .srcXincr       =   0, // don't care
                                                            .destXincr      =   0, // don't care
                                                            .xCount         =   0, // don't care
                                                            .srcYincr       =   0, // don't care
                                                            .destYincr      =   0, // don't care
                                                            .yCount         =   0, // don't care
                                                            .descrNext      =   0,
                                                        };

#elif (TLE9563_CRC_EN == 0)
/* Copy SPI TX buffer into SPI TX FIFO */
static  cy_stc_pdma_descr_config_t  stcDmaDescrConfig1e =  {
                                                            .deact          =   0,
                                                            .intrType       =   CY_PDMA_INTR_1ELEMENT_CMPLT,
                                                            .trigoutType    =   CY_PDMA_TRIGOUT_1ELEMENT_CMPLT,
                                                            .chStateAtCmplt =   CY_PDMA_CH_DISABLED, 
                                                            .triginType     =   CY_PDMA_TRIGIN_1ELEMENT,
                                                            .dataSize       =   CY_PDMA_WORD,
                                                            .srcTxfrSize    =   CY_PDMA_TXFR_SIZE_DATA_SIZE,
                                                            .destTxfrSize   =   CY_PDMA_TXFR_SIZE_DATA_SIZE,
                                                            .descrType      =   CY_PDMA_SINGLE_TRANSFER,
                                                            .srcAddr        =   (void*) &au8TxBuffer.u32Word,
                                                            .destAddr       =   (void*) &CY_SPI_SCB_TYPE->unTX_FIFO_WR.u32Register,
                                                            .srcXincr       =   0, // don't care
                                                            .destXincr      =   0, // don't care
                                                            .xCount         =   0, // don't care
                                                            .srcYincr       =   0, // don't care
                                                            .destYincr      =   0, // don't care
                                                            .yCount         =   0, // don't care
                                                            .descrNext      =   0,
                                                        };

