jassony/infineon2b6/TLE9563_LLD/src/TLE9563_CommLayer.c
/* Copy SPI RX FIFO into receive buffer without calculating the CRC afterwards */
static  cy_stc_pdma_descr_config_t  stcDmaDescrConfig11a =  {
                                                            .deact          =   0,
                                                            .intrType       =   CY_PDMA_INTR_1ELEMENT_CMPLT,
                                                            .trigoutType    =   CY_PDMA_TRIGOUT_1ELEMENT_CMPLT,
                                                            .chStateAtCmplt =   CY_PDMA_CH_DISABLED, 
                                                            .triginType     =   CY_PDMA_TRIGIN_1ELEMENT,
                                                            .dataSize       =   CY_PDMA_WORD,
                                                            .srcTxfrSize    =   CY_PDMA_TXFR_SIZE_DATA_SIZE,
                                                            .destTxfrSize   =   CY_PDMA_TXFR_SIZE_DATA_SIZE,
                                                            .descrType      =   CY_PDMA_SINGLE_TRANSFER,
                                                            .srcAddr        =   (void*) &CY_SPI_SCB_TYPE->unRX_FIFO_RD.u32Register,
                                                            .destAddr       =   (void*) &s_deviceDriver.un_SpiRx.u32Word,
                                                            .srcXincr       =   0, // don't care
                                                            .destXincr      =   0, // don't care
                                                            .xCount         =   0, // don't care
                                                            .srcYincr       =   0, // don't care
                                                            .destYincr      =   0, // don't care
                                                            .yCount         =   0, // don't care
                                                            .descrNext      =   0,
                                                        };
#endif

/* DMA - Channel configuration */
#if  (TLE9563_CRC_EN == 1)
const   cy_stc_pdma_chnl_config_t   chnlConfig1      =   {
                                                            .PDMA_Descriptor=   &stcDescr1a, // start descriptor chain with CRC calculation
                                                            .preemptable    =   0,
                                                            .priority       =   0,
                                                            .enable         =   0,  // keep disabled after initialization
                                                        };
#elif (TLE9563_CRC_EN == 0)
const   cy_stc_pdma_chnl_config_t   chnlConfig1      =   {
                                                            .PDMA_Descriptor=   &stcDescr1e, // start SPI transfer without CRC calculation
                                                            .preemptable    =   0,
                                                            .priority       =   0,
                                                            .enable         =   0,  // keep disabled after initialization
                                                        };
#endif
const   cy_stc_pdma_chnl_config_t   chnlConfig11      =   {
                                                            .PDMA_Descriptor=   &stcDescr11a,
                                                            .preemptable    =   0,
                                                            .priority       =   0,
                                                            .enable         =   0,  // keep disabled after initialization
                                                        };

/******************************************************************************/
/**                        Local Function Definitions                        **/
/******************************************************************************/


/*******************************************************************************
**                        Global Variable Definitions                         **
*******************************************************************************/


/*******************************************************************************
**                         Global Function Definitions                        **
*******************************************************************************/
/** \brief Set Peripheral Fraction Divider 24_5
 *
 */
void SetPeripheFracDiv24_5(uint64_t targetFreq, uint64_t sourceFreq, uint8_t divNum)
{
    uint64_t temp = ((uint64_t)sourceFreq << 5ull);
    uint32_t divSetting;

    divSetting = (uint32_t)(temp / targetFreq);
    Cy_SysClk_PeriphSetFracDivider(CY_SYSCLK_DIV_24_5_BIT, divNum, 
                                   (((divSetting >> 5ul) & 0x00000FFFul) - 1ul), 
                                   (divSetting & 0x0000001Ful));
}

/** \brief Initialize the SPI
 *
 */
void TLE9563_initSpi(void)
{
    /******************************************************/
    /******* Calculate divider setting for the SCB ********/
    /******************************************************/
    Cy_SysClk_PeriphAssignDivider(CY_SPI_SCB_PCLK, CY_SYSCLK_DIV_24_5_BIT, DIVIDER_NO_1);
    SetPeripheFracDiv24_5(SCB_SPI_CLOCK_FREQ, SOURCE_CLOCK_FRQ, DIVIDER_NO_1);
    Cy_SysClk_PeriphEnableDivider(CY_SYSCLK_DIV_24_5_BIT, 1u); 

    /********************************************/
    /*    De-initialization for peripherals     */
    /********************************************/
    Cy_SCB_SPI_DeInit(CY_SPI_SCB_TYPE);

    /**************************************/
    /* Port Setting for SPI communication */
    /**************************************/
    /* According to the HW environment to change SCB CH*/
    SPI_port_pin_cfg.driveMode = SCB_MISO_DRIVE_MODE;
    SPI_port_pin_cfg.hsiom = CY_SPI_SCB_MISO_MUX;
    Cy_GPIO_Pin_Init(CY_SPI_SCB_MISO_PORT, CY_SPI_SCB_MISO_PIN, &SPI_port_pin_cfg);

    SPI_port_pin_cfg.driveMode = SCB_MOSI_DRIVE_MODE;
    SPI_port_pin_cfg.hsiom = CY_SPI_SCB_MOSI_MUX;
    Cy_GPIO_Pin_Init(CY_SPI_SCB_MOSI_PORT, CY_SPI_SCB_MOSI_PIN, &SPI_port_pin_cfg);

