jassony/infineon2b6/TLE9563_LLD/src/TLE9563_CommLayer.c
    SPI_port_pin_cfg.driveMode = SCB_CLK_DRIVE_MODE;
//    SPI_port_pin_cfg.hsiom = CY_SPI_SCB_CLK_MUX;
    Cy_GPIO_Pin_Init(CY_SPI_SCB_CLK_PORT,CY_SPI_SCB_CLK_PIN, &SPI_port_pin_cfg);
    
    SPI_port_pin_cfg.driveMode = SCB_SEL0_DRIVE_MODE;
    SPI_port_pin_cfg.hsiom = CY_SPI_SCB_SEL0_MUX;
    Cy_GPIO_Pin_Init(CY_SPI_SCB_SEL0_PORT, CY_SPI_SCB_SEL0_PIN, &SPI_port_pin_cfg);

    /********************************************/
    /* SCB initialization for SPI communication */
    /********************************************/
    Cy_SCB_SPI_Init(CY_SPI_SCB_TYPE, &SCB_SPI_cfg, NULL);
    Cy_SCB_SPI_SetActiveSlaveSelect(CY_SPI_SCB_TYPE, 0ul);
    Cy_SCB_SPI_Enable(CY_SPI_SCB_TYPE);
}

/** \brief Initialize the PDMA
 * \brief Descriptors are initialized
 * \brief SPI RX output trigger is connected to trigger input of pdma channel 11
 *
 */
void TLE9563_initDma(void)
{
  /******/
  /* DW */
  /******/  
  Cy_PDMA_Disable(PDMA_INSTANCE);
#if  (TLE9563_CRC_EN == 1)
  Cy_PDMA_CRC_Config(PDMA_INSTANCE, &stcCrcConfig);
  Cy_PDMA_Descr_Init(&stcDescr1a, &stcDmaDescrConfig1a);
  Cy_PDMA_Descr_Init(&stcDescr1b, &stcDmaDescrConfig1b);
  Cy_PDMA_Descr_Init(&stcDescr1c, &stcDmaDescrConfig1c);
  Cy_PDMA_Descr_Init(&stcDescr1d, &stcDmaDescrConfig1d);
  Cy_PDMA_Descr_Init(&stcDescr11b, &stcDmaDescrConfig11b);
  Cy_PDMA_Descr_Init(&stcDescr11c, &stcDmaDescrConfig11c);
  Cy_PDMA_Descr_Init(&stcDescr11d, &stcDmaDescrConfig11d);
#endif
  Cy_PDMA_Descr_Init(&stcDescr1e, &stcDmaDescrConfig1e); 
  Cy_PDMA_Descr_Init(&stcDescr11a, &stcDmaDescrConfig11a);
  Cy_PDMA_Chnl_SetInterruptMask(PDMA_INSTANCE, PDMA_CH11);
  Cy_PDMA_Enable(PDMA_INSTANCE);
  
  /***************/
  /* Trigger MUX */
  /***************/
  Cy_TrigMux_Connect1To1(TRIG_OUT_1TO1_8_SCB_RX_TO_PDMA11, 0, TRIGGER_TYPE_CPUSS_DW1_TR_IN__EDGE, 0);
}

/** \brief Send out SPI read message
 * \brief PDMA channels are initialized and enabled
 * \brief PDMA channel 1 is triggered
 *
 * \param u8_address address of the register
 *
 */
void TLE9563_getReg(uint8_t u8_address)
{
  /************************* Build 32 bit SPI message *************************/
  /** bit[0:6]:       address                                                **/
  /** bit[7]:         ACTION (0: read)                                       **/
  /** bit[8:23]:      0x0000, no data                                        **/
  /** bit[24:31]:     8bit crc or static pattern                             **/

  au8TxBuffer.au8Bytes[0] = u8_address | (uint8_t)TLE9563_SPI_ACTION_READ;
  au8TxBuffer.au8Bytes[1] = 0x00;
  au8TxBuffer.au8Bytes[2] = 0x00;
  // CRC static pattern will be overwriten, if CRC is calculated
  au8TxBuffer.au8Bytes[3] = TLE9563_CRC_STATIC_PATTERN_MOSI;

  // Initialize channel 1 and 11 with according descriptors
  Cy_PDMA_Chnl_Init(PDMA_INSTANCE, PDMA_CH1, (const cy_stc_pdma_chnl_config_t*) &chnlConfig1);
  Cy_PDMA_Chnl_Init(PDMA_INSTANCE, PDMA_CH11, (const cy_stc_pdma_chnl_config_t*) &chnlConfig11);
  // Clear interrupt of channel 1, interrupt for channel 11 is cleared in isr
  Cy_PDMA_Chnl_ClearInterrupt(PDMA_INSTANCE, PDMA_CH1);
  // Enable channel 1 and 11, channels are disabled after descriptor chain completion
  Cy_PDMA_Chnl_Enable(PDMA_INSTANCE, PDMA_CH1);
  Cy_PDMA_Chnl_Enable(PDMA_INSTANCE, PDMA_CH11);
  // Trigger DMA channel 1 by software, channel 11 will be triggered by spi rx
  PDMA_INSTANCE->CH_STRUCT[PDMA_CH1].unTR_CMD.u32Register = 1;
}

/** \brief Send out SPI write message
 * \brief PDMA channels are initialized and enabled
 * \brief PDMA channel 1 is triggered
 *
 * \param u8_address address of the register
 * \param u16_data data to be written
 *
 */
void TLE9563_setReg(uint8_t u8_address, uint16_t u16_data)
{
  /************************* Build 32 bit SPI message *************************/
  /** bit[0:6]:       address                                                **/
  /** bit[7]:         ACTION (1: write)                                      **/
  /** bit[8:23]:      data to be written                                     **/
  /** bit[24:31]:     8bit crc or static pattern                             **/
  
  au8TxBuffer.au8Bytes[0] = u8_address | (uint8_t)TLE9563_SPI_ACTION_WRITE;
  au8TxBuffer.au8Bytes[1] = u16_data;
  au8TxBuffer.au8Bytes[2] = u16_data >> 8;
  // CRC static pattern will be overwriten, if CRC is calculated
  au8TxBuffer.au8Bytes[3] = TLE9563_CRC_STATIC_PATTERN_MOSI;

  // Initialize channel 1 and 11 with according descriptors
  Cy_PDMA_Chnl_Init(PDMA_INSTANCE, PDMA_CH1, (const cy_stc_pdma_chnl_config_t*) &chnlConfig1);
  Cy_PDMA_Chnl_Init(PDMA_INSTANCE, PDMA_CH11, (const cy_stc_pdma_chnl_config_t*) &chnlConfig11);
  // Clear interrupt of channel 1, interrupt for channel 11 is cleared in isr
  Cy_PDMA_Chnl_ClearInterrupt(PDMA_INSTANCE, PDMA_CH1);
  // Enable channel 1 and 11, channels are disabled after descriptor chain completion
  Cy_PDMA_Chnl_Enable(PDMA_INSTANCE, PDMA_CH1);
  Cy_PDMA_Chnl_Enable(PDMA_INSTANCE, PDMA_CH11);
  // Trigger DMA channel 1 by software, channel 11 will be triggered by spi rx
  PDMA_INSTANCE->CH_STRUCT[PDMA_CH1].unTR_CMD.u32Register = 1;
}

/** \brief Send out SPI write message for banked register
 * \brief PDMA channels are initialized and enabled
 * \brief PDMA channel 1 is triggered
 *
 * \param u8_address address of the register
 * \param e_bank register bank
 * \param u16_data data to be written
 *
 */
void TLE9563_setBankReg(uint8_t u8_address, tDEVICE_regBank e_bank, uint16_t u16_data)
{
  /************************* Build 32 bit SPI message *************************/
  /** bit[0:6]:       address                                                **/
  /** bit[7]:         ACTION (1: write)                                      **/
  /** bit[8:10]:      register bank                                          **/
  /** bit[11]:        0, reserved                                            **/
  /** bit[12:23]:     data to be written                                     **/
  /** bit[24:31]:     8bit crc or static pattern                             **/

  au8TxBuffer.au8Bytes[0] = u8_address | (uint8_t)TLE9563_SPI_ACTION_WRITE;
  au8TxBuffer.au8Bytes[1] = u16_data | e_bank;
  au8TxBuffer.au8Bytes[2] = u16_data >> 8;
  // CRC static pattern will be overwriten, if CRC is calculated
  au8TxBuffer.au8Bytes[3] = TLE9563_CRC_STATIC_PATTERN_MOSI;

