jassony/infineon2b6/TLE9563_LLD/src/TLE9563_CommLayer.c
  // Initialize channel 1 and 11 with according descriptors
  Cy_PDMA_Chnl_Init(PDMA_INSTANCE, PDMA_CH1, (const cy_stc_pdma_chnl_config_t*) &chnlConfig1);
  Cy_PDMA_Chnl_Init(PDMA_INSTANCE, PDMA_CH11, (const cy_stc_pdma_chnl_config_t*) &chnlConfig11);
  // Clear interrupt of channel 1, interrupt for channel 11 is cleared in isr
  Cy_PDMA_Chnl_ClearInterrupt(PDMA_INSTANCE, PDMA_CH1);
  // Enable channel 1 and 11, channels are disabled after descriptor chain completion
  Cy_PDMA_Chnl_Enable(PDMA_INSTANCE, PDMA_CH1);
  Cy_PDMA_Chnl_Enable(PDMA_INSTANCE, PDMA_CH11);
  // Trigger DMA channel 1 by software, channel 11 will be triggered by spi rx
  PDMA_INSTANCE->CH_STRUCT[PDMA_CH1].unTR_CMD.u32Register = 1;
}

/** \brief Send out SPI read message for banked register
 * \brief PDMA channels are initialized and enabled
 * \brief PDMA channel 1 is triggered
 *
 * \param u8_address address of the register
 * \param e_bank register bank
 *
 */
void TLE9563_getBankReg(uint8_t u8_address, tDEVICE_regBank e_bank)
{
  /************************* Build 32 bit SPI message *************************/
  /** bit[0:6]:       address                                                **/
  /** bit[7]:         ACTION (0: read)                                       **/
  /** bit[8:10]:      register bank                                          **/
  /** bit[11]:        0, reserved                                            **/
  /** bit[12:23]:     0x0000, no data                                        **/
  /** bit[24:31]:     8bit crc or static pattern                             **/

  au8TxBuffer.au8Bytes[0] = u8_address | (uint8_t)TLE9563_SPI_ACTION_WRITE;
  au8TxBuffer.au8Bytes[1] = 0x00 | e_bank;
  au8TxBuffer.au8Bytes[2] = 0x00;
  // CRC static pattern will be overwriten, if CRC is calculated
  au8TxBuffer.au8Bytes[3] = TLE9563_CRC_STATIC_PATTERN_MOSI;

  // Initialize channel 1 and 11 with according descriptors
  Cy_PDMA_Chnl_Init(PDMA_INSTANCE, PDMA_CH1, (const cy_stc_pdma_chnl_config_t*) &chnlConfig1);
  Cy_PDMA_Chnl_Init(PDMA_INSTANCE, PDMA_CH11, (const cy_stc_pdma_chnl_config_t*) &chnlConfig11);
  // Clear interrupt of channel 1, interrupt for channel 11 is cleared in isr
  Cy_PDMA_Chnl_ClearInterrupt(PDMA_INSTANCE, PDMA_CH1);
  // Enable channel 1 and 11, channels are disabled after descriptor chain completion
  Cy_PDMA_Chnl_Enable(PDMA_INSTANCE, PDMA_CH1);
  Cy_PDMA_Chnl_Enable(PDMA_INSTANCE, PDMA_CH11);
  // Trigger DMA channel 1 by software, channel 11 will be triggered by spi rx
  PDMA_INSTANCE->CH_STRUCT[PDMA_CH1].unTR_CMD.u32Register = 1;
}

/** \brief Send out static pattern via SPI
 * \brief Static pattern is used for CRC recovery
 * \brief PDMA channel 11 is initialized and enabled
 * \brief Data is written directly into SPI TX FIFO, no crc calculation needed by PDMA
 *
 */
void TLE9563_sendStaticCrcRecovery(void)
{ 
  /************************** Build 32 bit SPI message **************************/
  /** bit[0:7]:   addr + rw_bit (MSB): 0x67 to enable CRC, 0xE7 to disable CRC **/
  /** bit[12:23]: data (MSB):          0xAAAA                                  **/
  /** bit[24:31]: crc (MSB):           0x0E to enable CRC, 0xC3 to disable CRC **/

  au8TxBuffer.au8Bytes[1] = 0x55;
  au8TxBuffer.au8Bytes[2] = 0x55;
  
  #if (TLE9563_CRC_EN == 1)
    au8TxBuffer.au8Bytes[0] = 0xE6;
    au8TxBuffer.au8Bytes[3] = 0x70;
  #else
    au8TxBuffer.au8Bytes[0] = 0xE7;
    au8TxBuffer.au8Bytes[3] = 0xC3;
  #endif
    
  // Initialize channel 11 with according descriptors
  Cy_PDMA_Chnl_Init(PDMA_INSTANCE, PDMA_CH11, (const cy_stc_pdma_chnl_config_t*) &chnlConfig11);
  // Enable channel 11, channels are disabled after descriptor chain completion
  Cy_PDMA_Chnl_Enable(PDMA_INSTANCE, PDMA_CH11);
    
  // Write data directly into SPI TX FIFO
  CY_SPI_SCB_TYPE->unTX_FIFO_WR.u32Register = au8TxBuffer.u32Word;
}

/** @}*/ /* End of group TLE9563_COMMLAYER */

